In [29]:
import pandas as pd
movies = pd.read_csv('./data/movie_summaries_ada/movie.metadata.tsv', sep='\t', header=None)
cpi_data = pd.read_csv("./data/cpi_data/API_FP.CPI.TOTL.ZG_DS2_en_csv_v2_5994714.csv", sep=',', skiprows=4)
budget_data = pd.read_csv('./data/movies_budget/movies_metadata.csv', sep=',')

/var/folders/zd/swfytvpn4w7b_b35x8v4xrgm0000gn/T/ipykernel_74117/2582371815.py:4: DtypeWarning: Columns (10) have mixed types. Specify dtype option on import or set low_memory=False.
  budget_data = pd.read_csv('./data/movies_budget/movies_metadata.csv', sep=',')

In [70]:
#Get and clean budget data
budget = budget_data[["budget", "id", "imdb_id", "original_title", "revenue"]]
print(len(budget))
budget["budget"] = pd.to_numeric(budget["budget"], errors='coerce').dropna().astype(int)
budget = budget.dropna()
budget = budget[budget["budget"] != 0]
print(len(budget))
budget.head()

45466
8888

/var/folders/zd/swfytvpn4w7b_b35x8v4xrgm0000gn/T/ipykernel_74117/1619235859.py:4: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  budget["budget"] = pd.to_numeric(budget["budget"], errors='coerce').dropna().astype(int)

       budget     id    imdb_id     original_title      revenue
0  30000000.0    862  tt0114709          Toy Story  373554033.0
1  65000000.0   8844  tt0113497            Jumanji  262797249.0
3  16000000.0  31357  tt0114885  Waiting to Exhale   81452156.0
5  60000000.0    949  tt0113277               Heat  187436818.0
6  58000000.0  11860  tt0114319            Sabrina          0.0

In [71]:
#get and clean movies data
movies.columns = ['wikipedia_id', 'freebase_id', 'name', 'release_date', 'revenue', 'runtime', 'languages', 'countries', 'genres']
movie_rev = movies[["freebase_id", "name", "revenue"]]
print(len(movie_rev))
movie_rev = movie_rev.dropna()
print(len(movie_rev))
movie_rev.head()

81741
8401

   freebase_id                      name      revenue
0    /m/03vyhn            Ghosts of Mars   14010832.0
7   /m/02qc0j7  Alexander's Ragtime Band    3600000.0
13   /m/016ywb                   Henry V   10161099.0
17    /m/0kcn7              Mary Poppins  102272727.0
21   /m/02wjqm            New Rose Hotel      21521.0

In [68]:
#Get CPI data
cpi_data_movies = cpi_data[cpi_data["Country Code"] == "USA"]
cpi_data_movies

,Country Name,Country Code,Indicator Name,Indicator Code,1960,1961,1962,1963,1964,1965,...,2014,2015,2016,2017,2018,2019,2020,2021,2022,Unnamed: 67
251,United States,USA,"Inflation, consumer prices (annual %)",FP.CPI.TOTL.ZG,1.457976,1.070724,1.198773,1.239669,1.278912,1.585169,...,1.622223,0.118627,1.261583,2.13011,2.442583,1.81221,1.233584,4.697859,8.0028,NaN